___

<p style="text-align: center;"><img src="https://docs.google.com/uc?id=1lY0Uj5R04yMY3-ZppPWxqCr5pvBLYPnV" class="img-fluid" alt="CLRSWY"></p>

___

<h1><p style="text-align: center;">Pandas Lesson, Session - 4</p><h1>

# Data Frames

 - ### ``DataFrames`` are the workhorse of pandas and are directly inspired by the R programming language. We can think of a DataFrame as a bunch of Series objects put together to share the same index. Let's use pandas to explore this topic!

In [1]:
import pandas as pd
import numpy as np

 - ### Creating a DataFrame using the ``list``s of data and columns

In [2]:
datas = [1, 3, 5, 7, 9, 18]

In [3]:
datas

[1, 3, 5, 7, 9, 18]

In [4]:
pd.DataFrame(datas, columns = ["column1"])

   column1
0        1
1        3
2        5
3        7
4        9
5       18

 - ### Creating a DataFrame using a ``NumPy Arrays``

In [7]:
m = np.arange(1,24,2).reshape(3,4)

In [8]:
m

array([[ 1,  3,  5,  7],
       [ 9, 11, 13, 15],
       [17, 19, 21, 23]])

In [12]:
df = pd.DataFrame(m, columns = "var1 var2 var3 var4".split())

In [13]:
df

   var1  var2  var3  var4
0     1     3     5     7
1     9    11    13    15
2    17    19    21    23

In [14]:
df.head()

   var1  var2  var3  var4
0     1     3     5     7
1     9    11    13    15
2    17    19    21    23

In [15]:
df.head(2)

   var1  var2  var3  var4
0     1     3     5     7
1     9    11    13    15

In [16]:
df.tail(2)

   var1  var2  var3  var4
1     9    11    13    15
2    17    19    21    23

In [18]:
df.sample(2)

   var1  var2  var3  var4
0     1     3     5     7
2    17    19    21    23

In [19]:
df.columns

Index(['var1', 'var2', 'var3', 'var4'], dtype='object')

In [20]:
for i in df.columns:
    print(i)

var1
var2
var3
var4

In [23]:
print(*df.columns)

var1 var2 var3 var4

In [24]:
df.columns = ["new1", "new2", "new3", "new4"]
df

   new1  new2  new3  new4
0     1     3     5     7
1     9    11    13    15
2    17    19    21    23

In [25]:
type(df)

pandas.core.frame.DataFrame

In [26]:
df.shape

(3, 4)

In [27]:
df.ndim

2

In [28]:
df.size

12

In [29]:
df.values

array([[ 1,  3,  5,  7],
       [ 9, 11, 13, 15],
       [17, 19, 21, 23]])

In [30]:
type(df.values)

numpy.ndarray

 - ### Creating a DataFrame using a ``dict``

In [31]:
s1 = np.random.randint(2,10, size = 4)
s2 = np.random.randint(3,10, size = 4)
s3 = np.random.randint(4,15, size = 4)

In [32]:
s1

array([5, 7, 7, 8])

In [33]:
s2

array([7, 5, 6, 5])

In [34]:
s3

array([ 4,  7, 11,  7])

In [35]:
myDict = {"var1":s1, "var2":s2 , "var3":s3}

In [36]:
df1 = pd.DataFrame(myDict)

In [37]:
df1

   var1  var2  var3
0     5     7     4
1     7     5     7
2     7     6    11
3     8     5     7

- Quick show of reding csv files into dataframes

In [40]:
df = pd.read_csv("ornek.csv")
df

     a   b     c
0   10  12   3.0
1   11  33  34.0
2   44  51   NaN
3   10  12   4.0
4   11  33  35.0
5   44  51   0.0
6   10  12   5.0
7   11  33  36.0
8   44  51  25.0
9   10  12   6.0
10  11  33  37.0
11  44  51   NaN
12  10  12   7.0
13  11  33  38.0
14  44  51   NaN

- Simple indexing and slicing the ``DataFrames``

In [41]:
df1

   var1  var2  var3
0     5     7     4
1     7     5     7
2     7     6    11
3     8     5     7

In [42]:
df1[1:3]

   var1  var2  var3
1     7     5     7
2     7     6    11

In [44]:
df1.index

RangeIndex(start=0, stop=4, step=1)

In [45]:
[i for i in df1.index]

[0, 1, 2, 3]

In [48]:
df1.index = ["a", "b", "c", "d"]

In [49]:
df1

   var1  var2  var3
a     5     7     4
b     7     5     7
c     7     6    11
d     8     5     7

In [50]:
df1["b":"d"]

   var1  var2  var3
b     7     5     7
c     7     6    11
d     8     5     7

In [51]:
# we can check any column name whether it belongs to the DataFrame or not

"var2" in df1

True

In [52]:
"var5" in df1

False

### Now, let's examine again the ***idexing, selection*** and ***slicing*** methods and several ***attributes*** using a different DataFrame

In [53]:
from numpy.random import randn
np.random.seed(101)

In [54]:
df3 = pd.DataFrame(randn(5,4), index = 'A B C D E'.split(), columns = 'W X Y Z'.split())

In [55]:
df3

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [56]:
# creating a DataFrame by "positional arguments"

pd.DataFrame(np.random.randn(5,4), "a b c d e".split(), "w x y z".split())

          w         x         y         z
a  0.302665  1.693723 -1.706086 -1.159119
b -0.134841  0.390528  0.166905  0.184502
c  0.807706  0.072960  0.638787  0.329646
d -0.497104 -0.754070 -0.943406  0.484752
e -0.116773  1.901755  0.238127  1.996652

In [268]:
# creating a DataFrame by "keyword arguments"

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

## Selection and Indexing

Let's learn the various methods to grab data from a DataFrame

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

#### DataFrame Columns are just Series

pandas.core.series.Series

          Y
A  0.907969
B -0.848077
C  0.528813
D -0.933237
E  2.605967

pandas.core.frame.DataFrame

In [276]:
# Pass a list of column names

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077
C -2.018168  0.528813
D  0.188695 -0.933237
E  0.190794  2.605967

In [277]:
# SQL Syntax (NOT RECOMMENDED!)

A    0.628133
B   -0.319318
C    0.740122
D   -0.758872
E    1.978757
Name: X, dtype: float64

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

**Creating a new column:**

In [288]:
df3

          W         X         Y         Z        WZ
A  0.386030  2.084019 -0.376519  0.230336  0.616367
B  0.681209  1.035125 -0.031160  1.939932  2.621142
C -1.005187 -0.741790  0.187125 -0.732845 -1.738032
D -1.382920  1.482495  0.961458 -2.141212 -3.524132
E  0.992573  1.192241 -1.046780  1.292765  2.285338

### [Removing Columns & Rows](http://localhost:8888/notebooks/pythonic/DAwPythonSessions/w3resource-pandas-dataframe-drop.ipynb)

 - ### Removing Columns

          W         X         Y         Z
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
C -1.005187 -0.741790  0.187125 -0.732845
D -1.382920  1.482495  0.961458 -2.141212
E  0.992573  1.192241 -1.046780  1.292765

In [291]:
# Not inplace unless specified!

          W         X         Y         Z        WZ
A  0.386030  2.084019 -0.376519  0.230336  0.616367
B  0.681209  1.035125 -0.031160  1.939932  2.621142
C -1.005187 -0.741790  0.187125 -0.732845 -1.738032
D -1.382920  1.482495  0.961458 -2.141212 -3.524132
E  0.992573  1.192241 -1.046780  1.292765  2.285338

In [293]:
df3

          W         X         Y         Z
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
C -1.005187 -0.741790  0.187125 -0.732845
D -1.382920  1.482495  0.961458 -2.141212
E  0.992573  1.192241 -1.046780  1.292765

 - ### Removing rows

In [294]:
# the default value of axis is 0 (axis = 0)

          W         X         Y         Z
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
C -1.005187 -0.741790  0.187125 -0.732845
D -1.382920  1.482495  0.961458 -2.141212

### Selecting Rows

- ### First, let's take a quick look at [`.loc[]`](http://localhost:8888/notebooks/pythonic/DAwPythonSessions/w3resource-pandas-dataframe-loc.ipynb) | [`.iloc[]`](http://localhost:8888/notebooks/pythonic/DAwPythonSessions/w3resource-pandas-dataframe-iloc.ipynb)

#### `.loc[]`  allows us to select data using **labels** (names) of rows (index) & columns

#### `.iloc[]`  allows us to select data using **index numbers** of rows (index) & columns. it's like classical indexing logic

In [296]:

df4 = pd.DataFrame(m, columns = ["var1","var2","var3",'var4'])
df4

   var1  var2  var3  var4
0    24    23    22    27
1    13     3    41    18
2     2    26     3    17
3     3    25    16    30
4     7    29    43    23
5    49    21    26    34
6    47     8     9    17
7    30     1    45    41

var1    13
var2     3
var3    41
var4    18
Name: 1, dtype: int32

In [298]:
# Slicing produces the same type of the data. Here, DataFrame

   var1  var2  var3  var4
1    13     3    41    18
2     2    26     3    17
3     3    25    16    30
4     7    29    43    23

   var1  var2  var3  var4
1    13     3    41    18
2     2    26     3    17
3     3    25    16    30

In [302]:
df4

   var1  var2  var3  var4
a    24    23    22    27
b    13     3    41    18
c     2    26     3    17
d     3    25    16    30
e     7    29    43    23
f    49    21    26    34
g    47     8     9    17
h    30     1    45    41

   var1  var2  var3  var4
b    13     3    41    18
c     2    26     3    17
d     3    25    16    30

   var1  var2  var3  var4
c     2    26     3    17
d     3    25    16    30
e     7    29    43    23
f    49    21    26    34

   var1  var2  var3  var4
a    24    23    22    27
b    13     3    41    18
c     2    26     3    17
d     3    25    16    30
e     7    29    43    23
f    49    21    26    34
g    47     8     9    17
h    30     1    45    41

34

d    30
e    23
f    34
g    17
Name: var4, dtype: int32

In [312]:
# how can we select these data as a DataFrame not a series

   var3
b    41
c     3
d    16
e    43
f    26

c    17
d    30
e    23
f    34
Name: var4, dtype: int32

   var4
c    17
d    30
e    23

#### Let's continue to examine `.loc[]` and `.iloc[]` using ``df3`` again

          W         X         Y         Z
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
C -1.005187 -0.741790  0.187125 -0.732845
D -1.382920  1.482495  0.961458 -2.141212
E  0.992573  1.192241 -1.046780  1.292765

W   -1.005187
X   -0.741790
Y    0.187125
Z   -0.732845
Name: C, dtype: float64

Or select based off of position instead of label

W   -1.005187
X   -0.741790
Y    0.187125
Z   -0.732845
Name: C, dtype: float64

In [319]:
# returns as a DataFrame

          W         X        Y         Z
B  0.681209  1.035125 -0.03116  1.939932

In [320]:
# returns as a DataFrame

          W         X        Y         Z
B  0.681209  1.035125 -0.03116  1.939932

In [321]:
# Well, how can we select entire column "Y" using ".iloc[]"

A    0.230336
B    1.939932
C   -0.732845
D   -2.141212
E    1.292765
Name: Z, dtype: float64

          Z
A  0.230336
B  1.939932
C -0.732845
D -2.141212
E  1.292765

          Y
A -0.376519
B -0.031160
C  0.187125
D  0.961458
E -1.046780

### Selecting subset of rows and columns

 - ### `.loc[[row labels|names], [column labels|names]]`

 - ### `.iloc[[row index numbers], [column index numbers]]`

In [324]:
df3

          W         X         Y         Z
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
C -1.005187 -0.741790  0.187125 -0.732845
D -1.382920  1.482495  0.961458 -2.141212
E  0.992573  1.192241 -1.046780  1.292765

-0.031160481493099617

In [326]:
# let's select the same data as a DataFrame

         Y
B -0.03116

          W         Y
A  0.386030 -0.376519
B  0.681209 -0.031160

          W         Y
A  0.386030 -0.376519
B  0.681209 -0.031160

### Conditional Selection

An important feature of pandas is conditional selection using bracket notation, very similar to numpy:

In [329]:
df3

          W         X         Y         Z
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
C -1.005187 -0.741790  0.187125 -0.732845
D -1.382920  1.482495  0.961458 -2.141212
E  0.992573  1.192241 -1.046780  1.292765

In [330]:
# returns a DataFrame consists of bool type

       W      X      Y      Z
A   True   True  False   True
B   True   True  False   True
C  False  False   True  False
D  False   True   True  False
E   True   True  False   True

    W         X   Y         Z
A NaN  2.084019 NaN       NaN
B NaN  1.035125 NaN  1.939932
C NaN       NaN NaN       NaN
D NaN  1.482495 NaN       NaN
E NaN  1.192241 NaN  1.292765

In [336]:
# It returns based on rows.

          W         X         Y         Z
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
D -1.382920  1.482495  0.961458 -2.141212
E  0.992573  1.192241 -1.046780  1.292765

A    0.230336
B    1.939932
E    1.292765
Name: Z, dtype: float64

In [339]:
# how can we select the data as a DataFrame

          Z
A  0.230336
B  1.939932
E  1.292765

          Y         X
A -0.376519  2.084019
B -0.031160  1.035125
E -1.046780  1.192241

#### For two conditions you can use **|**  `or`,  **&**   `and` with parenthesis:

In [341]:
df3

          W         X         Y         Z
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
C -1.005187 -0.741790  0.187125 -0.732845
D -1.382920  1.482495  0.961458 -2.141212
E  0.992573  1.192241 -1.046780  1.292765

          W         X         Y         Z
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
E  0.992573  1.192241 -1.046780  1.292765

#### Conditional selection using ``.loc[]`` and ``.iloc[]``

In [345]:
df3

          W         X         Y         Z
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
C -1.005187 -0.741790  0.187125 -0.732845
D -1.382920  1.482495  0.961458 -2.141212
E  0.992573  1.192241 -1.046780  1.292765

          X         Z
A  2.084019  0.230336
B  1.035125  1.939932
D  1.482495 -2.141212
E  1.192241  1.292765

          W         Y
C -1.005187  0.187125
D -1.382920  0.961458

## More Index Details

Let's discuss some more features of indexing, including resetting the index or setting it something else. We'll also talk about index hierarchy!

In [353]:
df3

          W         X         Y         Z
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
C -1.005187 -0.741790  0.187125 -0.732845
D -1.382920  1.482495  0.961458 -2.141212
E  0.992573  1.192241 -1.046780  1.292765

In [354]:
# Reset to default 0,1...n index

  index         W         X         Y         Z
0     A  0.386030  2.084019 -0.376519  0.230336
1     B  0.681209  1.035125 -0.031160  1.939932
2     C -1.005187 -0.741790  0.187125 -0.732845
3     D -1.382920  1.482495  0.961458 -2.141212
4     E  0.992573  1.192241 -1.046780  1.292765

In [355]:
df3

          W         X         Y         Z
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
C -1.005187 -0.741790  0.187125 -0.732845
D -1.382920  1.482495  0.961458 -2.141212
E  0.992573  1.192241 -1.046780  1.292765

          W         X         Y         Z
0  0.386030  2.084019 -0.376519  0.230336
1  0.681209  1.035125 -0.031160  1.939932
2 -1.005187 -0.741790  0.187125 -0.732845
3 -1.382920  1.482495  0.961458 -2.141212
4  0.992573  1.192241 -1.046780  1.292765

In [359]:
df3

          W         X         Y         Z States
A  0.386030  2.084019 -0.376519  0.230336     CA
B  0.681209  1.035125 -0.031160  1.939932     NY
C -1.005187 -0.741790  0.187125 -0.732845     WY
D -1.382920  1.482495  0.961458 -2.141212     OR
E  0.992573  1.192241 -1.046780  1.292765     CO

               W         X         Y         Z
States
CA      0.386030  2.084019 -0.376519  0.230336
NY      0.681209  1.035125 -0.031160  1.939932
WY     -1.005187 -0.741790  0.187125 -0.732845
OR     -1.382920  1.482495  0.961458 -2.141212
CO      0.992573  1.192241 -1.046780  1.292765

In [361]:
df3

          W         X         Y         Z States
A  0.386030  2.084019 -0.376519  0.230336     CA
B  0.681209  1.035125 -0.031160  1.939932     NY
C -1.005187 -0.741790  0.187125 -0.732845     WY
D -1.382920  1.482495  0.961458 -2.141212     OR
E  0.992573  1.192241 -1.046780  1.292765     CO

In [363]:
df3

               W         X         Y         Z
States
CA      0.386030  2.084019 -0.376519  0.230336
NY      0.681209  1.035125 -0.031160  1.939932
WY     -1.005187 -0.741790  0.187125 -0.732845
OR     -1.382920  1.482495  0.961458 -2.141212
CO      0.992573  1.192241 -1.046780  1.292765

## Multi-Index and Index Hierarchy

Let us go over how to work with Multi-Index, first we'll create a quick example of what a Multi-Indexed DataFrame would look like:

In [385]:
# Index Levels
outside = ['M1', 'M1', 'M1', 'M2', 'M2', 'M2','M3', 'M3', 'M3']
inside = [1, 2, 3, 1, 2, 3, 5, 6, 7]

multi_index

[('M1', 1),
 ('M1', 2),
 ('M1', 3),
 ('M2', 1),
 ('M2', 2),
 ('M2', 3),
 ('M3', 5),
 ('M3', 6),
 ('M3', 7)]

In [387]:
hier_index

MultiIndex([('M1', 1),
            ('M1', 2),
            ('M1', 3),
            ('M2', 1),
            ('M2', 2),
            ('M2', 3),
            ('M3', 5),
            ('M3', 6),
            ('M3', 7)],
           )

In [388]:

df5

             A         B         C         D
M1 1 -0.466770 -1.174098 -0.077359  1.366345
   2  1.241589 -2.919887  0.547547  0.294506
   3 -1.681709 -0.643638 -1.504789 -0.018412
M2 1  0.818920  0.921243 -0.420953 -1.480718
   2 -0.738039 -2.101540  0.093586 -0.353061
   3  0.850009 -1.057667  0.877860 -0.369412
M3 5 -0.658974  0.517662  0.552467  1.406739
   6 -0.605296  0.324131 -0.685692  0.204849
   7  1.677895 -0.874274  0.111478  1.546423

Now let's show how to index this! For index hierarchy we use ``df.loc[]``, if this was on the columns axis, you would just use normal bracket notation ``df[]``. Calling one level of the index returns the sub-dataframe:

          A         B         C         D
1 -0.466770 -1.174098 -0.077359  1.366345
2  1.241589 -2.919887  0.547547  0.294506
3 -1.681709 -0.643638 -1.504789 -0.018412

A    1.241589
B   -2.919887
C    0.547547
D    0.294506
Name: 2, dtype: float64

         A         B         C         D
1 -0.46677 -1.174098 -0.077359  1.366345

In [393]:
df5.index.names

FrozenList([None, None])

In [395]:
df5

                  A         B         C         D
Group Num
M1    1   -0.466770 -1.174098 -0.077359  1.366345
      2    1.241589 -2.919887  0.547547  0.294506
      3   -1.681709 -0.643638 -1.504789 -0.018412
M2    1    0.818920  0.921243 -0.420953 -1.480718
      2   -0.738039 -2.101540  0.093586 -0.353061
      3    0.850009 -1.057667  0.877860 -0.369412
M3    5   -0.658974  0.517662  0.552467  1.406739
      6   -0.605296  0.324131 -0.685692  0.204849
      7    1.677895 -0.874274  0.111478  1.546423

### let's take a quick look at the [``.xs()``](http://localhost:8888/notebooks/pythonic/DAwPythonSessions/w3resource-pandas-dataframe-xs.ipynb)

            A         B         C         D
Num
1   -0.466770 -1.174098 -0.077359  1.366345
2    1.241589 -2.919887  0.547547  0.294506
3   -1.681709 -0.643638 -1.504789 -0.018412

            A         B         C         D
Num
1   -0.466770 -1.174098 -0.077359  1.366345
2    1.241589 -2.919887  0.547547  0.294506
3   -1.681709 -0.643638 -1.504789 -0.018412

In [398]:
df5

                  A         B         C         D
Group Num
M1    1   -0.466770 -1.174098 -0.077359  1.366345
      2    1.241589 -2.919887  0.547547  0.294506
      3   -1.681709 -0.643638 -1.504789 -0.018412
M2    1    0.818920  0.921243 -0.420953 -1.480718
      2   -0.738039 -2.101540  0.093586 -0.353061
      3    0.850009 -1.057667  0.877860 -0.369412
M3    5   -0.658974  0.517662  0.552467  1.406739
      6   -0.605296  0.324131 -0.685692  0.204849
      7    1.677895 -0.874274  0.111478  1.546423

A    1.241589
B   -2.919887
C    0.547547
D    0.294506
Name: (M1, 2), dtype: float64

A   -0.605296
B    0.324131
C   -0.685692
D    0.204849
Name: (M3, 6), dtype: float64

                  A         B         C         D
Group Num
M3    7    1.677895 -0.874274  0.111478  1.546423

              A         B         C         D
Group
M3    -0.658974  0.517662  0.552467  1.406739

              A         B
Group
M1    -0.006354 -1.403832
M2     0.545812 -0.693707

Group  Num
M1     1     -0.077359
       2      0.547547
       3     -1.504789
M2     1     -0.420953
       2      0.093586
       3      0.877860
M3     5      0.552467
       6     -0.685692
       7      0.111478
Name: C, dtype: float64

# End of the Session

In [168]:
import seaborn as sns

In [169]:

df

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

(150, 5)

2

750

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

     sepal_length  sepal_width  petal_length  petal_width    species
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

     sepal_length  sepal_width  petal_length  petal_width     species
28            5.2          3.4           1.4          0.2      setosa
83            6.0          2.7           5.1          1.6  versicolor
5             5.4          3.9           1.7          0.4      setosa
100           6.3          3.3           6.0          2.5   virginica

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal_length  150 non-null    float64
 1   sepal_width   150 non-null    float64
 2   petal_length  150 non-null    float64
 3   petal_width   150 non-null    float64
 4   species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa
5           5.4          3.9           1.7          0.4  setosa
6           4.6          3.4           1.4          0.3  setosa
7           5.0          3.4           1.5          0.2  setosa
8           4.4          2.9           1.4          0.2  setosa

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa
5           5.4          3.9           1.7          0.4  setosa

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa
5           5.4          3.9           1.7          0.4  setosa
6           4.6          3.4           1.4          0.3  setosa

     sepal_length  sepal_width  petal_length  petal_width
0             5.1          3.5           1.4          0.2
1             4.9          3.0           1.4          0.2
2             4.7          3.2           1.3          0.2
3             4.6          3.1           1.5          0.2
4             5.0          3.6           1.4          0.2
..            ...          ...           ...          ...
145           6.7          3.0           5.2          2.3
146           6.3          2.5           5.0          1.9
147           6.5          3.0           5.2          2.0
148           6.2          3.4           5.4          2.3
149           5.9          3.0           5.1          1.8

[150 rows x 4 columns]

    sepal_length  sepal_width  petal_length  petal_width species
0            5.1          3.5           1.4          0.2  setosa
5            5.4          3.9           1.7          0.4  setosa
10           5.4          3.7           1.5          0.2  setosa
14           5.8          4.0           1.2          0.2  setosa
15           5.7          4.4           1.5          0.4  setosa

     sepal_length  sepal_width  petal_length  petal_width    species
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica